index.org
#+title: CAS CS 320: Concepts of Programming Languages
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: html-style:nil H:1 toc:nil num:nil
CAS CS 320 is a course /about/ programming languages, particularly the
*design* and *implementation* of programming languages.  In this
course, we take up the programming language as an /object of formal
study/.  See the course manual and the schedule below for more
details.
* Links
+ [[file:manual/main.pdf][Course Manual]]
+ [[https://github.com/BU-CS320/cs320-s26][Course Repository]]
+ [[https://nmmull.github.io/stdlib320/stdlib320/Stdlib320/index.html][Course Standard Library]]
+ [[file:book/main.pdf][Course Textbook (DRAFT)]]
+ [[https://piazza.com/bu/spring2026/cascs320][Piazza]]
+ [[https://www.gradescope.com/courses/1222812][Gradescope]] (V44GKB)
* Schedule
|------+--------------------------------------+------------------+----------------------------------|
| Date | Topic                                | Reading/Material | Notes                            |
|------+--------------------------------------+------------------+----------------------------------|
| 1/20 | Introducing OCaml                    | [[file:book/main.pdf][COPL 1]], OCP [[https://cs3110.github.io/textbook/chapters/intro/intro.html][1]], [[https://cs3110.github.io/textbook/chapters/basics/intro.html][2]] | Read the course manual           |
| 1/22 | Recursion and Lists                  | OCP [[https://cs3110.github.io/textbook/chapters/data/lists.html][3.1]], [[https://cs3110.github.io/textbook/chapters/data/assoc_list.html][3.8]]     | [[file:assigns/assign1/assign1.org][Assignment 1 (A1)]] out            |
|------+--------------------------------------+------------------+----------------------------------|
| 1/26 | Lab 1: [[file:labs/lab01/lab01.org][Verifying your Set-up]]         |                  |                                  |
| 1/27 | Designing Functions (Workshop)       |                  |                                  |
| 1/29 | Polymorphism                         |                  | [[file:assigns/assign2/assign2.org][A2]] out, A1 due                   |
|------+--------------------------------------+------------------+----------------------------------|
| 2/2  | Lab 2: [[file:labs/lab02/lab02.org][Mutual Recursion]]              |                  |                                  |
| 2/3  | Inference Rules                      | COPL 2.1         |                                  |
| 2/5  | Derivations                          | COPL 2.2, 2.3    | [[file:assigns/assign3/assign3.org][A3]] out, A2 due                   |
|------+--------------------------------------+------------------+----------------------------------|
| 2/9  | Lab 3: [[file:labs/lab03/lab03.org][Derivations Worksheet]]         |                  |                                  |
| 2/10 | Products and Sums                    | OCP [[https://cs3110.github.io/textbook/chapters/data/intro.html][3]]            |                                  |
| 2/12 | Algebraic Data Types (Workshop)      | OCP [[https://cs3110.github.io/textbook/chapters/data/intro.html][3]]            | A4 out, A3 due                   |
|------+--------------------------------------+------------------+----------------------------------|
| 2/16 | *No Lab*                             |                  | Presidents’ Day                  |
| 2/17 | Lab 4: Midterm Review                |                  | Substitute Monday                |
| 2/19 | *Midterm 1*                          |                  |                                  |
|------+--------------------------------------+------------------+----------------------------------|
| 2/23 | Lab 5: S-Expressions                 |                  |                                  |
| 2/24 | Higher-Order Programming             | OCP [[https://cs3110.github.io/textbook/chapters/hop/intro.html][4]]            |                                  |
| 2/26 | Practical FP (Workshop)              | OCP [[https://cs3110.github.io/textbook/chapters/hop/intro.html][4]]            | A5 out, A4 due                   |
|------+--------------------------------------+------------------+----------------------------------|
| 3/2  | Lab 6: When2Meet                     |                  |                                  |
| 3/3  | Formal Grammar                       | COPL 3.1-3.3     |                                  |
| 3/5  | Grammatical Ambiguity                | COPL 3.4-3.6     | A6 out, A5 due                   |
|------+--------------------------------------+------------------+----------------------------------|
| 3/9  | *No Lab*                             |                  | Spring recess                    |
| 3/10 | *No Lecture*                         |                  | Spring recess                    |
| 3/12 | *No Lecture*                         |                  | Spring recess                    |
|------+--------------------------------------+------------------+----------------------------------|
| 3/16 | Lab 7: Parser Generators             |                  |                                  |
| 3/17 | Operational Semantics                |                  |                                  |
| 3/19 | Substitution                         |                  | Mini-Project 1 (MP1) out, A6 due |
|------+--------------------------------------+------------------+----------------------------------|
| 3/23 | Lab 8: Grammar worksheet             |                  |                                  |
| 3/24 | Closures and Environments (Workshop) |                  |                                  |
| 3/26 | Simple Types                         |                  | MP1 check-in due                 |
|------+--------------------------------------+------------------+----------------------------------|
| 3/30 | Lab 9: Midterm Review                |                  |                                  |
| 3/31 | **Midterm 2**                        |                  |                                  |
| 4/2  | Progress and Preservation            |                  | MP2 out, MP1 due                 |
|------+--------------------------------------+------------------+----------------------------------|
| 4/6  | Lab 10: Closures Worksheet           |                  |                                  |
| 4/7  | Pattern Matching                     |                  |                                  |
| 4/9  | Exhaustiveness Checking              |                  | MP2 check-in due                 |
|------+--------------------------------------+------------------+----------------------------------|
| 4/13 | Lab 11: Pattern Matching Worksheet   |                  |                                  |
| 4/14 | Hindley-Milner                       |                  |                                  |
| 4/16 | Unification (Workshop)               |                  | MP3 out, MP2 due                 |
|------+--------------------------------------+------------------+----------------------------------|
| 4/20 | *No Lab*                             |                  | Patriots’ Day                    |
| 4/21 | Principle Types                      |                  |                                  |
| 4/22 | Lab 12: Principle Types Worksheet    |                  |                                  |
| 4/23 | Specialization                       |                  | MP3 check-in due                 |
|------+--------------------------------------+------------------+----------------------------------|
| 4/27 | Lab 13: Final Exam Review            |                  |                                  |
| 4/28 | Bytecode Interpreters                |                  |                                  |
| 4/30 | Final Exam Review Session (Workshop) |                  | MP3 due                          |
|------+--------------------------------------+------------------+----------------------------------|
* Calendar
#+begin_export html
<iframe src="https://calendar.google.com/calendar/embed?height=600&wkst=1&ctz=America%2FNew_York&showPrint=0&showTitle=0&showTabs=0&showCalendars=0&showTz=0&mode=WEEK&src=Y18yYzczYjQzZjY2MTMyZjI1NjUyMGYxODNkNmNjYzVmMjI0ODg2Mjk2MzdmNGJhNTNhNWI0ZTVlY2U2YzRmNGVmQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20&color=%23e4c441" style="border-width:0" width="1000" height="600" frameborder="0" scrolling="no"></iframe>
#+end_export
* Course Staff
+ Instructor: [[https://nmmull.github.io][Nathan Mull]]
+ Teaching Fellow: Anthony DeRossi
+ Teaching Assistant: Vivian Tvedt
+ Course Assistants: Miranda Quimbar and Shiyun Yang
