index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-08 Sun 17:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CAS CS 320: Concepts of Programming Languages</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CAS CS 320: Concepts of Programming Languages</h1>
<p>
CAS CS 320 is a course <i>about</i> programming languages, particularly the
<b>design</b> and <b>implementation</b> of programming languages.  In this
course, we take up the programming language as an <i>object of formal
study</i>.  See the course manual and the schedule below for more
details.
</p>
<div id="outline-container-orgfa88422" class="outline-2">
<h2 id="orgfa88422">Links</h2>
<div class="outline-text-2" id="text-orgfa88422">
<ul class="org-ul">
<li><a href="manual/main.pdf">Course Manual</a></li>
<li><a href="https://github.com/BU-CS320/cs320-s26">Course Repository</a></li>
<li><a href="https://nmmull.github.io/stdlib320/stdlib320/Stdlib320/index.html">Course Standard Library</a></li>
<li><a href="book/main.pdf">Course Textbook (DRAFT)</a></li>
<li><a href="https://piazza.com/bu/spring2026/cascs320">Piazza</a></li>
<li><a href="https://www.gradescope.com/courses/1222812">Gradescope</a> (V44GKB)</li>
</ul>
</div>
</div>
<div id="outline-container-org6454a45" class="outline-2">
<h2 id="org6454a45">Schedule</h2>
<div class="outline-text-2" id="text-org6454a45">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Reading/Material</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1/20</td>
<td class="org-left">Introducing OCaml</td>
<td class="org-left"><a href="book/main.pdf">COPL 1</a>, OCP <a href="https://cs3110.github.io/textbook/chapters/intro/intro.html">1</a>, <a href="https://cs3110.github.io/textbook/chapters/basics/intro.html">2</a></td>
<td class="org-left">Read the course manual</td>
</tr>

<tr>
<td class="org-left">1/22</td>
<td class="org-left">Recursion and Lists</td>
<td class="org-left">OCP <a href="https://cs3110.github.io/textbook/chapters/data/lists.html">3.1</a>, <a href="https://cs3110.github.io/textbook/chapters/data/assoc_list.html">3.8</a></td>
<td class="org-left"><a href="assigns/assign1/assign1.html">Assignment 1 (A1)</a> out</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1/26</td>
<td class="org-left">Lab 1: <a href="labs/lab01/lab01.html">Verifying your Set-up</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1/27</td>
<td class="org-left">Designing Functions (Workshop)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1/29</td>
<td class="org-left">Polymorphism</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><a href="assigns/assign2/assign2.html">A2</a> out, A1 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2/2</td>
<td class="org-left">Lab 2: <a href="labs/lab02/lab02.html">Mutual Recursion</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/3</td>
<td class="org-left">Inference Rules</td>
<td class="org-left">COPL 2.1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/5</td>
<td class="org-left">Derivations</td>
<td class="org-left">COPL 2.2, 2.3</td>
<td class="org-left"><a href="assigns/assign3/assign3.html">A3</a> out, A2 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2/9</td>
<td class="org-left">Lab 3: <a href="labs/lab03/lab03.html">Derivations Worksheet</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/10</td>
<td class="org-left">Products and Sums</td>
<td class="org-left">OCP <a href="https://cs3110.github.io/textbook/chapters/data/intro.html">3</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/12</td>
<td class="org-left">Algebraic Data Types (Workshop)</td>
<td class="org-left">OCP <a href="https://cs3110.github.io/textbook/chapters/data/intro.html">3</a></td>
<td class="org-left">A4 out, A3 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2/16</td>
<td class="org-left"><b>No Lab</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Presidents’ Day</td>
</tr>

<tr>
<td class="org-left">2/17</td>
<td class="org-left">Lab 4: Midterm Review</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Substitute Monday</td>
</tr>

<tr>
<td class="org-left">2/19</td>
<td class="org-left"><b>Midterm 1</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2/23</td>
<td class="org-left">Lab 5: S-Expressions</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/24</td>
<td class="org-left">Higher-Order Programming</td>
<td class="org-left">OCP <a href="https://cs3110.github.io/textbook/chapters/hop/intro.html">4</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">2/26</td>
<td class="org-left">Practical FP (Workshop)</td>
<td class="org-left">OCP <a href="https://cs3110.github.io/textbook/chapters/hop/intro.html">4</a></td>
<td class="org-left">A5 out, A4 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/2</td>
<td class="org-left">Lab 6: When2Meet</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/3</td>
<td class="org-left">Formal Grammar</td>
<td class="org-left">COPL 3.1-3.3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/5</td>
<td class="org-left">Grammatical Ambiguity</td>
<td class="org-left">COPL 3.4-3.6</td>
<td class="org-left">A6 out, A5 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/9</td>
<td class="org-left"><b>No Lab</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Spring recess</td>
</tr>

<tr>
<td class="org-left">3/10</td>
<td class="org-left"><b>No Lecture</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Spring recess</td>
</tr>

<tr>
<td class="org-left">3/12</td>
<td class="org-left"><b>No Lecture</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Spring recess</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/16</td>
<td class="org-left">Lab 7: Parser Generators</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/17</td>
<td class="org-left">Operational Semantics</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/19</td>
<td class="org-left">Substitution</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Mini-Project 1 (MP1) out, A6 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/23</td>
<td class="org-left">Lab 8: Grammar worksheet</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/24</td>
<td class="org-left">Closures and Environments (Workshop)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/26</td>
<td class="org-left">Simple Types</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">MP1 check-in due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3/30</td>
<td class="org-left">Lab 9: Midterm Review</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">3/31</td>
<td class="org-left"><b><b>Midterm 2</b></b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/2</td>
<td class="org-left">Progress and Preservation</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">MP2 out, MP1 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4/6</td>
<td class="org-left">Lab 10: Closures Worksheet</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/7</td>
<td class="org-left">Pattern Matching</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/9</td>
<td class="org-left">Exhaustiveness Checking</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">MP2 check-in due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4/13</td>
<td class="org-left">Lab 11: Pattern Matching Worksheet</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/14</td>
<td class="org-left">Hindley-Milner</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/16</td>
<td class="org-left">Unification (Workshop)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">MP3 out, MP2 due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4/20</td>
<td class="org-left"><b>No Lab</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Patriots’ Day</td>
</tr>

<tr>
<td class="org-left">4/21</td>
<td class="org-left">Principle Types</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/22</td>
<td class="org-left">Lab 12: Principle Types Worksheet</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/23</td>
<td class="org-left">Specialization</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">MP3 check-in due</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4/27</td>
<td class="org-left">Lab 13: Final Exam Review</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/28</td>
<td class="org-left">Bytecode Interpreters</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">4/30</td>
<td class="org-left">Final Exam Review Session (Workshop)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">MP3 due</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orge2cf3e4" class="outline-2">
<h2 id="orge2cf3e4">Calendar</h2>
<div class="outline-text-2" id="text-orge2cf3e4">
<iframe src="https://calendar.google.com/calendar/embed?height=600&wkst=1&ctz=America%2FNew_York&showPrint=0&showTitle=0&showTabs=0&showCalendars=0&showTz=0&mode=WEEK&src=Y18yYzczYjQzZjY2MTMyZjI1NjUyMGYxODNkNmNjYzVmMjI0ODg2Mjk2MzdmNGJhNTNhNWI0ZTVlY2U2YzRmNGVmQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20&color=%23e4c441" style="border-width:0" width="1000" height="600" frameborder="0" scrolling="no"></iframe>
</div>
</div>
<div id="outline-container-orgdb7d8f9" class="outline-2">
<h2 id="orgdb7d8f9">Course Staff</h2>
<div class="outline-text-2" id="text-orgdb7d8f9">
<ul class="org-ul">
<li>Instructor: <a href="https://nmmull.github.io">Nathan Mull</a></li>
<li>Teaching Fellow: Anthony DeRossi</li>
<li>Teaching Assistant: Vivian Tvedt</li>
<li>Course Assistants: Miranda Quimbar and Shiyun Yang</li>
</ul>
</div>
</div>
</div>
</body>
</html>
